data = """Хан Ган	2024	Кванджу, Южная Корея
Юн Фоссе	2023	Хёугесунн, Норвегия
Анни Эрно	2022	Лильбонн, Франция
Абдулразак Гурна	2021	Занзибар
Луиза Глюк	2020	Нью-Йорк
Петер Хандке	2019	Гриффен, Австрия
Ольга Токарчук	2018	Сулехув, Польша
Кадзуо Исигуро	2017	Нагасаки, Япония
Боб Дилан	2016	Дулут, Миннесота США
Светлана Алексиевич	2015	Станислав, СССР
Патрик Модиано	2014	Булонь-Бийанкур, Франция
Элис Энн Манро	2013	Вингем, Канада
Мо Янь	2012	Шаньдун, КНР
Тумас Транстремер	2011	Стокгольм, Швеция
Марио Варгас Льоса	2010	Арекипа, Перу
Герта Мюллер	2009	Ницкидорф, Румыния
Жан-Мари Гюстав Леклезио	2008	Ницца, Франция
Дорис Лессинг	2007	Керманшах, Персия
Орхан Памук	2006	Стамбул, Турция
Гарольд Пинтер	2005	Лондон, Великобритани
Эльфрида Елинек	2004	Мюрццушлаг, Австрия
Джон Максвелл Кутзее	2003	Кейптаун, ЮАР
Имре Кертес	2002	Будапешт, Венгрия
Видиадхар Сураджпрасад Найпол	2001	Тринидад, Тринидад и Тобаго
Гао Синцзянь	2000	Ганьчжоу, КНР
Гюнтер Грасс	1999	Вольный город Данциг, Германия
Жозе Сарамаго	1998	Азиньяга, Португалия
Дарио Фо	1997	Санджано, Италия
Вислава Шимборска	1996	Бнин, Польша
Шеймус Хини	1995	Кастлдоусон, Ирландия
Кэнзабуро Оэ	1994	Осэ, Япония
Тони Моррисон	1993	Лорейн, США
Дерек Уолкотт	1992	Кастри, Сент-Люсия
Надин Гордимер	1991	Гаутенг, ЮАР
Октавио Пас	1990	Мехико, Мексика
Камило Хосе Села	1989	Ирия, Испания
Нагиб Махфуз	1988	Каир, Египет
Иосиф Бродский	1987	Ленинград, СССР
Воле Шойинка	1986	Абеокута, Нигерия
Клод Симон	1985	Антананариву, Мадагаскар
Ярослав Сейферт	1984	Прага, Чехия
Уильям Голдинг	1983	Сент-Коламб Майнор, Великобритания
Габриэль Гарсия Маркес	1982	Аракатака, Колумбия
Элиас Канетти	1981	Русе, Болгария
Чеслав Милош	1980	Шетени, Россия
Одисеас Элитис	1979	Ираклион, Греция
Исаак Башевис Зингер	1978	Леончин, Россия
Висенте Алейксандре	1977	Севилья, Испания
Сол Беллоу	1976	Лашин, Канада
Эудженио Монтале	1975	Генуя, Италия
Эйвинд Йонсон	1974	Салтшобаден, Швеци
Харри Мартинсон	1974	Йемсхёг, Швеция
Патрик Виктор Мартиндейл Уайт	1973	Лондон, Великобритани
Генрих Белль	1972	Кёльн, Германия
Пабло Неруда	1971	Парраль, Чили
Александр Исаевич Солженицын	1970	Кисловодск, СССР
Сэмюэл Беккет	1969	Дублин, Ирландия
Ясунари Кавабата	1968	Осака, Япония
Мигель Астуриас	1967	Гватемала, Гватемала
Шмуэль Йозеф Агнон	1966	Бучач, Австро-Венгрия
Нелли Закс	1966	Шёнеберг, Германия
Михаил Александрович Шолохов	1965	Кружилин, СССР
Жан-Поль Сартр	1964	Париж, Франция
Георгос Сеферис	1963	Урла, Турция
Джон Стейнбек	1962	Салинас, США
Иво Андрич	1961	Долац, Австро-Венгрия
Сен-Жон Перс	1960	Пуэнт-а-Питр, Гваделупа
Сальваторе Квазимодо	1959	Модик, Итали
Борис Леонидович Пастернак	1958	Москва, Россия
Альбер Камю	1957	Мондови, Алжир
Хуан Рамон Хименес	1956	Андалусия, Испания
Хальдоур Кильян Лакснесс	1955	Рейкявик, Исландия
Эрнест Миллер Хемингуэй	1954	Оук-Парк, США
Уинстон Леонард Спенсер Черчилль	1953	Бланим-Пэлис, Великобритания
Франсуа Мориак	1952	Бордо, Франция
Пер Фабиан Лагерквист	1951	Вексьё, Швеция
Бертран Рассел	1950	Рейвенскрофт, Великобритания
Уильям Фолкнер	1949	Нью-Олбани, США
Томас Стернз Элиот	1948	Сент-Луис, США
Андре Жид	1947	Париж, Франция
Герман Гессе	1946	Кальв, Германия
Габриела Мистраль	1945	Викуньа, Чили
Йоханнес Йенсен	1944	Химмерланд, Дания
Франс Эмиль Силланпя	1939	Хямеэнкюрё, Великое княжество Финляндское (Российская империя)
Перл Бак	1938	Хилсборо, США
Роже Мартен Дю Гар	1937	Нейи-сюр-Сен, Франция
Юджин ОНил	1936	Нью-Йорк, США
Луиджи Пиранделло	1934	Джирдженти, Италия
Иван Алексеевич Бунин	1933	Воронеж, Россия
Джон Голсуорси	1932	Кингстон-Хилл, Великобриания
Эрик Карлфельдт	1931	Фолькерна, Швеция
Синклер Льюис	1930	Соук-Сентер, США
Томас Манн	1929	Любек, Германи
Сигрид Унсет	1928	Калуннборг, Дания
Анри Бергсон	1927	Париж, Франция
Грация Деледда	1926	Нуоро, Италия
Джордж Бернард Шоу	1925	Дублин, Ирландия
Владислав Станислав Реймонт	1924	Кобеле-Вельке, Российская империя
Уильям Батлер Йитс	1923	Дублин, Ирландия
Хасинто Бенавенте - И - Мартинес	1922	Мадрид, Испания
Анатоль Франс	1921	Париж, Франция
Кнут Гамсун	1920	Лом, Норвегия
Карл Фридрих Георг Шпиттелер	1919	Листал, Швецария
Карл Адольф Гьеллеруп	1917	Рохольт, Дания
Хенрик Понтоппидан	1917	Фредерисии, Дания
Карл Густав Вернер фон Хейденстам	1916	Эльсхаммар, Швеция
Ромен Роллан	1915	Кламси, Франция
Рабиндранат Тагор	1913	Калькутта, Индия
Герхардт Гауптман	1912	Оберзальцбрунн, Германия
Морис Метерлинк	1911	Гент, Бельгия
Пауль Йоханн Людвиг фон Хейзе	1910	Берлин, Германия
Сельма Лагерлеф	1909	Вермланд, Швеция
Рудольф Кристоф Эйкен	1908	Аурих, Германия
Джозеф Редьярд Киплинг	1907	Бомбей, Индия
Джозуэ Кардуччи	1906	Валь-ди-Кастелло, Итали
Генрик Сенкевич	1905	Окжейска, Российская империя
Фредерик Мистраль	1904	Мейан, Франция
Хосе Мария Вальдо Эчегарай - И - Эйсагирре	1904	Мадрид, Испания
Бьернстерне Мартиниус Бьернсон	1903	Квикне, Норвегия
Теодор Моммзен	1902	Гардинг, Дания
Рене Сюлли-Прюдом	1901	Париж, Франция"""

data_dict = {}
for data_row in data.split('\n'):
    key, value = '', 0
    for el in data_row.strip().split():
        if el.isdigit():
            value = int(el)
            break
        key += el + ' '
    key = key.strip()
    data_dict[key] = value
print(data_dict[input()])